Eshell-Magick.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-05-18 Fri 10:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Eshell Magick</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jonathan Arkell" />
<link href="https://fonts.googleapis.com/css?family=Inconsolata|Nixie+One|Taviraj:300,400" rel="stylesheet"><link href="./assets/styles/tufte-style.css" rel="stylesheet"></head>
<body>
<div id="preamble" class="status">
<menu class="top"><a href="index.html"> Index </a><a href="Emagician.html"> Emagician </a><a href="Emagician-Base.html"> Base </a><a href="Emagician-Install.html"> Install </a><a href="Emagician-Meta.html"> Meta </a><a href="Interface.html"> Interface </a><a href="Programming.html"> Programming </a><a href="Text.html"> Text </a><a href="Org-Grimoire.html"> Org </a><a href="Lamp.html"> Lamp </a><a href="Journal.html"> Journal </a><a href="Snippets.html"> Snippets </a></menu><menu class="ext"><a class="dotnet" href="http://www.jonnay.net/">jonnay.net</a><a class="github" href="https://github.com/jonnay/emagicians-starter-kit">Fork on Github</a></menu>
</div>
<div id="content">
<h1 class="title">Eshell Magick</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd9e40cb">1. About the name&#x2026;</a></li>
<li><a href="#org2fb4bfd">2. Fixes</a>
<ul>
<li><a href="#org5a6c03e">2.1. Jigger path so that jamf won't break shit</a></li>
<li><a href="#org767a557">2.2. Execute an eshell Command Programmatically </a></li>
<li><a href="#org02b1ea7">2.3. Use helm for history</a></li>
<li><a href="#org99496a8">2.4. Fix an issue with running commands remotely through tramp</a></li>
<li><a href="#org0dcf14f">2.5. Pager 😻</a></li>
</ul>
</li>
<li><a href="#org0320b95">3. Interface</a>
<ul>
<li><a href="#orga3375ba">3.1. Set Prompt</a></li>
<li><a href="#orgb8ce5f1">3.2. Use my own theme</a></li>
<li><a href="#org67b3aaf">3.3. Did you mean?</a></li>
<li><a href="#org6d1b0fe">3.4. Show fringe</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgd9e40cb" class="outline-2">
<h2 id="orgd9e40cb"><span class="section-number-2">1</span> About the name&#x2026;</h2>
<div class="outline-text-2" id="text-1">
<p>
If this file is called <code>eshell.org</code>, it weaves into <code>eshell.el</code>, and
then <code>require</code> gets problematic.
</p>

<pre class="code"><code>(add-hook 'emacs-startup-hook 'eshell)
</code></pre>
</div>
</div>

<div id="outline-container-org2fb4bfd" class="outline-2">
<h2 id="org2fb4bfd"><span class="section-number-2">2</span> Fixes</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org5a6c03e" class="outline-3">
<h3 id="org5a6c03e"><span class="section-number-3">2.1</span> Jigger path so that jamf won't break shit</h3>
<div class="outline-text-3" id="text-2-1">
<p>
jamf adds a symlink to the path, which makes completion barf when starting eshell.
</p>

<p>
¯\<sub>(ツ)</sub>_/¯
</p>

<p>
So we will jiggery poke the path.
</p>
<pre class="code"><code>(setenv <span class="org-string">"PATH"</span>
        (replace-regexp-in-string <span class="org-string">":/usr/local/bin/jamf"</span>
                                                <span class="org-string">""</span>
                                                (getenv <span class="org-string">"PATH"</span>)))
</code></pre>
</div>
</div>
<div id="outline-container-org767a557" class="outline-3">
<h3 id="org767a557"><span class="section-number-3">2.2</span> Execute an eshell Command Programmatically <label for="1" class="margin-toggle sidenote-number"></label><input type="checkbox" id="1" class="margin-toggle"/><span class="sidenote">
Thank you <a href="https://emacs.stackexchange.com/questions/7617/how-to-programmatically-execute-a-command-in-eshell">wasamasa</a>
</span></h3>
<div class="outline-text-3" id="text-2-2">
<pre class="code"><code>(<span class="org-keyword">defun</span> <span class="org-function-name">emagician/eshell-command</span> (cmd) 
  (<span class="org-keyword">with-current-buffer</span> <span class="org-string">"*eshell*"</span>
     (eshell-return-to-prompt)
     (insert cmd)
     (eshell-send-input)))
</code></pre>
</div>
</div>

<div id="outline-container-org02b1ea7" class="outline-3">
<h3 id="org02b1ea7"><span class="section-number-3">2.3</span> Use helm for history</h3>
<div class="outline-text-3" id="text-2-3">
<pre class="code"><code>(<span class="org-keyword">use-package</span> <span class="org-constant">eshell</span>
  <span class="org-builtin">:demand</span> 
  <span class="org-builtin">:bind</span> (<span class="org-builtin">:map</span> eshell-mode-map
         (<span class="org-string">"M-S-r"</span> . helm-eshell-history)))
</code></pre>
</div>
</div>

<div id="outline-container-org99496a8" class="outline-3">
<h3 id="org99496a8"><span class="section-number-3">2.4</span> Fix an issue with running commands remotely through tramp</h3>
<div class="outline-text-3" id="text-2-4">
<p>
<a href="http://emacs.stackexchange.com/questions/2107/run-application-in-cwd-on-remote-host-from-within-eshell">http://emacs.stackexchange.com/questions/2107/run-application-in-cwd-on-remote-host-from-within-eshell</a>
</p>

<p>
This is apparently still an issue. 
</p>

<pre class="code"><code>(<span class="org-keyword">defadvice</span> <span class="org-function-name">eshell-gather-process-output</span> (before absolute-cmd (command args) act)
  (<span class="org-keyword">setq</span> command (file-truename command)))

(add-to-list 'tramp-remote-path 'tramp-own-remote-path)
</code></pre>
</div>
</div>

<div id="outline-container-org0dcf14f" class="outline-3">
<h3 id="org0dcf14f"><span class="section-number-3">2.5</span> Pager 😻</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Use cat as a pager.  Fixes all kinds of things.
</p>

<pre class="code"><code>(setenv <span class="org-string">"PAGER"</span> <span class="org-string">"cat"</span>)
</code></pre>
</div>
</div>
</div>


<div id="outline-container-org0320b95" class="outline-2">
<h2 id="org0320b95"><span class="section-number-2">3</span> Interface</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orga3375ba" class="outline-3">
<h3 id="orga3375ba"><span class="section-number-3">3.1</span> Set Prompt</h3>
<div class="outline-text-3" id="text-3-1">
<pre class="code"><code>(<span class="org-keyword">use-package</span> <span class="org-constant">eshell-prompt-extras</span>
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> eshell-highlight-prompt nil
        eshell-prompt-function 'emagician/epe-theme))
</code></pre>
</div>
</div>

<div id="outline-container-orgb8ce5f1" class="outline-3">
<h3 id="orgb8ce5f1"><span class="section-number-3">3.2</span> Use my own theme</h3>
<div class="outline-text-3" id="text-3-2">
<pre class="code"><code>(<span class="org-keyword">defun</span> <span class="org-function-name">emagician/epe-theme</span> ()
  <span class="org-doc">"Emagician Eshell Prompt Extras theme."</span>
  (<span class="org-keyword">setq</span> eshell-prompt-regexp <span class="org-string">"^[</span><span class="org-string"><span class="org-negation-char">^</span></span><span class="org-string">#\n&#128048;]*[#&#128048;]) "</span>)
  (concat
   <span class="org-string">"\n"</span>
   (<span class="org-keyword">epe-colorize-with-face</span> <span class="org-string">"\n"</span> 'mode-line)
   (<span class="org-keyword">when</span> (epe-remote-p)
     (<span class="org-keyword">epe-colorize-with-face</span> <span class="org-string">"[ Remote ]"</span>
                             'epe-remote-face))
   (<span class="org-keyword">epe-colorize-with-face</span> (eshell/pwd) 'epe-dir-face)
   (<span class="org-keyword">when</span> (epe-git-p)
     (concat
      (<span class="org-keyword">epe-colorize-with-face</span> <span class="org-string">":"</span> 'epe-dir-face)
      (<span class="org-keyword">epe-colorize-with-face</span>
       (concat (epe-git-branch)
               (epe-git-dirty)
               (epe-git-untracked)
               (<span class="org-keyword">let</span> ((unpushed (epe-git-unpushed-number)))
                 (<span class="org-keyword">unless</span> (= unpushed 0)
                   (concat <span class="org-string">":"</span> (number-to-string unpushed)))))
       'epe-git-face)))
   (<span class="org-keyword">epe-colorize-with-face</span> <span class="org-string">"\n &#128048;)"</span> 'epe-symbol-face)
   (<span class="org-keyword">epe-colorize-with-face</span> (<span class="org-keyword">if</span> (= (user-uid) 0) <span class="org-string">"#"</span> <span class="org-string">""</span>) 'epe-sudo-symbol-face)
   <span class="org-string">" "</span>))
</code></pre>
</div>
</div>

<div id="outline-container-org67b3aaf" class="outline-3">
<h3 id="org67b3aaf"><span class="section-number-3">3.3</span> Did you mean?</h3>
<div class="outline-text-3" id="text-3-3">
<pre class="code"><code>(<span class="org-keyword">use-package</span> <span class="org-constant">eshell-did-you-mean</span> 
  <span class="org-builtin">:demand</span>
  <span class="org-builtin">:config</span>
  (eshell-did-you-mean-setup))
</code></pre>
</div>
</div>

<div id="outline-container-org6d1b0fe" class="outline-3">
<h3 id="org6d1b0fe"><span class="section-number-3">3.4</span> Show fringe</h3>
<div class="outline-text-3" id="text-3-4">
<pre class="code"><code>(<span class="org-keyword">use-package</span> <span class="org-constant">eshell-fringe-status</span>
  <span class="org-builtin">:init</span>
  (add-hook 'eshell-mode-hook 'eshell-fringe-status-mode))
</code></pre>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
Thank you <a href="https://emacs.stackexchange.com/questions/7617/how-to-programmatically-execute-a-command-in-eshell">wasamasa</a>
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Jonathan Arkell</p>
<p class="date">Created: 2018-05-18 Fri 10:30</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
